Revit 2026 API

# KeyBasedTreeEntryError Properties

---

The KeyBasedTreeEntryError type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ErrorType | Indicates which of possible types of problems with loading and/or building a KeyBasedTreeEntries that this KeyBasedTreeEntryError represents. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

KeyBasedTreeEntryError Class

Autodesk.Revit.DB Namespace